Tekla Open API Reference for Tekla Structures 2025
BendSurface.EndFaceNormal2 Property
 Gets the second end face normal.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector EndFaceNormal2 { get; }
Public ReadOnly Property EndFaceNormal2 As Vector
	Get
Property Value
Type: Vector
See Also
Reference
BendSurface Class
Tekla.Structures.Model Namespace